# GetStripedRowsColor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..GetStripedRowsColor Method
ViewSchedule Class See Also
---
Gets the color applied to part of the pattern for a schedule with striped rows.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Color GetStripedRowsColor(
	StripedRowPattern index
)
```

Visual Basic
---
```text
Public Function GetStripedRowsColor ( _
	index As StripedRowPattern _
) As Color
```

Visual C++
---
```text
public:
Color^ GetStripedRowsColor(
	StripedRowPattern index
)
```

# ### Parameters
index
    Type: Autodesk.Revit.DB..::..StripedRowPattern The part of the striped row pattern.
# ### Return Value
The applied color of the pattern part.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace